app/controllers/organizations_controller.rb

SELECT "organizations".* FROM "organizations"
---
  def index
    @organization = Organization.all

INSERT INTO "organizations" ("name", "status", "images", "slogan", "address", "country", "tax_code", "ot_policy", "description", "landing_page", "company_type", "company_size", "working_days", "profile_image", "short_description", "published_at", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @organization = current_user.organizations.build(organization_params)

    respond_to do |format|
      if @organization.save

UPDATE "organizations" SET "company_type" = ?, "company_size" = ?, "working_days" = ?, "updated_at" = ? WHERE "organizations"."id" = ?  [["company_type", "Outsource"], ["company_size", "11-50"], ["working_days", "Full"], ["updated_at", "2024-04-03 09:09:11.830290"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @organization.update(organization_params)